{
  "id": 3216,
  "회사이름": "a딥센트",
  "회사제목": "h2SW 개발팀 리더",
  "회사설명": "span딥센트는 전통적인 Fragrance(향기)에 AI, IoT, Data science 기술을 접목하여 온디맨드 향기(fragrance-on-demand : FOD) 서비스와 슬립케어 솔루션을 개발하고 있는 디지털향기 분야의 선두기업입니다. \n\n고객의 향기에 대한 취향과 사용 데이터를 기반으로 추천 서비스를 제공하고 있으며 현재는 각종 센서를 통해 획득한 생체 정보 데이터를 활용하여 수면 향기 케어 솔루션을 개발하고 있습니다. 서비스의 지속적인 성과 관리와 이용자 행동 데이터 및 데이터의 활용으로 최고의 FOD 서비스를 함께 만들어갈 인재를 모십니다. \n\n\n[인재상]\n- 맡은 일에 책임감이 강한 분 \n- 본인의 전문 분야에서는 자신감이 넘치시는 분\n- 회사의 중요 목표를 이해하고 그에 맞는 개별 목표를 설정 및 실행하시는 분\n- 데이터만이 아닌 다양한 비즈니스 이슈 관점에서 고민을 할 수 있는 분\n- 데이터를 활용한 서비스 개선 및 신규서비스에 관심이 있는 분\n- 직군과 관계없이 어울릴 수 있고, 적극적인 커뮤니케이션을 하려고 노력하는 분",
  "주요업무": "span- 회사의 중요 목표를 이해하고 그에 맞는 개발팀 목표를 설정 및 실행\n- 사업전략과 연계된 기술전략 수립 및 회사에 필요한 신규 기술 스텍/프로세스를 검토하고 도입\n- SW 개발팀 리더 및 메인 개발자 (현재 운영중인 상업용 IoT 기반 서비스 시스템 운영 및 추가 개발, 연구용역개발)\n- 개발 팀원들을 성장시키고 개발 문화를 형성 (현재 개발자 2명 근무중)\n- 회사의 코드 리뷰 및 품질 담당\n- 기타 프로젝트 수행 계획 수립 및 진척사항 관리\n- 모바일/웹 서비스 개발의 Backend를 담당 또는 Frontend를 담당 또는 Data/machine learning pipeline 개발, MLOps 등을 담당",
  "자격요건": "span- 5년 이상의 개발 실무 경력(Web/App/Backend)이 있으신 분\n- 2년 이상 개발팀 리딩 경력\n- 실제 프로덕트 런칭 및 운영 경험\n- 협업 툴로써의 Git 활용에 대한 매우 높은 이해도\n- React native, Java, C/C++, Python, Ruby, JavaScript 중 하나 이상의 언어에 능숙하신 개발\n- 모바일 앱 또는 RESTful API 서버 개발 및 유지보수 경험\n- AWS, GCP 등 클라우드 컴퓨팅을 활용한 엔지니어링 경험\n- MySQL, MariaDB or Oracle 등의 Relational DB 사용 경험\n- 기업의 비즈니스파트너로서 전략적 안목과 폭넓은 시야, 경영과 매니지먼트의 이해도가 있으신 분",
  "우대사항": "span- Full-Stack 개발자\n- Frontend engineer 또는 Backend engineer\n- Mobile application 개발 경험이 있으신 개발자\n- 대규모 트래픽 처리를 요구하는 서버 개발 경험\n- 머신러닝 파이프라인 설계를 해서 고객에게 안정적으로 디플로이한 경험이 있는 분\n  (ex: TensorFlow Serving, Kubeflow)\n- 데이터 처리와 저장, 버저닝 프레임워크에 대한 경험이 있는 분 \n  (ex: Hadoop, Spark, Cassandra, Kafka, Pachyderm, etc.)\n- GPU 클러스터를 운영해보신 분\n- 1가지 이상의 소프트웨어 개발 방법론에 대해 이해하고 실제 프로젝트에 적용해 본 경험\n- AWS IoT 를 활용한 IoT 제품 개발 경험\n- 머신러닝 관련 이해/경험 (Machine learning engineer)\n- 딥러닝 모델 서빙 and/or 파이프라인 개발 경험\n- 개발언어: React native, C/C++과 python, java 등\n- OS: Linux, docker 및 kubenetes 에 대한 경험\n- 데이터 구조 및 알고리즘에 대한 깊은 이해 및 최적화\n- 컴퓨터공학/전산학과/IT/수학과/통계/빅데이터/머신러닝 관련 학위 보유하신 분\n- 비지니스 레벨의 영어 구사가 가능한 분",
  "혜택 및 복지": "span[근무환경]\n- 늦잠과 여유로운 아침이 있는 삶 가능 (오전 10시 출근)\n- 당신의 패션을 존중합니다. (자유복장)\n- 당신의 휴가 계획을 응원합니다! (자율휴가제)\n- 열심히 일한 당신 떠나요! (연월차제도)\n- 굶지말고 든든하게 (간식, 과일, 커피 제공)\n- 자유로운 소통을 위하여 (팀 회식비 지원)\n- 책책책 책을 읽읍시다 (업무 관련 도서 지원)\n- 개발자의 갬성은 장비로부터 (맥지원 일부)\n- 목돈마련 현실로 (청년내일채움공제)\n- 기쁨도 슬픔도 함께해요 (경조사지원)\n\n[급여조건]\n-협의 가능(개개인의 업무와 영역에 따라 차이는 있을 수 있으나, 기본적으로 직전 연봉이상으로 맞춰드리는 대우를 목표로 하고 있습니다. 또한, 업무 성과에 따라 스톡옵션 패키지 옵션이 부여됩니다.)\n\n[근무정보]\n- 채용인원 : 0명\n- 근로형태 : 정규직 \n- 근무장소 : 서울 강남 (3호선 신사역 또는 7호선 논현역 도보 6분거리)\n\n[전형일정]\n- 서류접수 기간 : ~ 채용 시 마감\n- 서류심사 ＞ 1차 인터뷰 ＞ 2차 인터뷰 ＞ 처우협의 ＞ 최종합격\n* 해당 공고는 수시 채용으로, 채용 완료 시 조기에 마감될 수 있습니다.\n\n[지원방법]\n- 병역 특례 업체 (전문연구요원 / 산업기능요원 / 보충역 채용 가능)\n- 서류전형: 개발 경험 중심의 이력서와 포트폴리오 제출\n- 입사지원 서류에 허위기재 사실이 발견될 경우, 전형 진행과 입사가 취소될 수 있습니다.",
  "기술스택 ・ 툴": "divGitLab\nSlack\nReact\nJavaScript\nTypeScript\nReact Native\nFigma"
}