{
  "id": 36835,
  "회사이름": "a레몬베이스",
  "회사제목": "h2QA Engineer (QA 엔지니어)",
  "회사설명": "span[2000만 일하는 사람의 성장이 내 일의 성과가 되는 팀, 레몬베이스]\n\n레몬베이스는 회사와 구성원의 건강한 성장을 기술로 실현하는 SaaS 스타트업입니다.\n\n사람은 깨어 있는 시간의 70%를 일터에서 보냅니다. 그 시간이 돈을 벌기 위한 수동적인 시간이 아니라, '나와 조직의 성장과 성공을 위해 주도적으로 활용하는 시간'이 될 수 있도록 레몬베이스는 성장하고 성과를 내는 방식을 기술을 통해 혁신하고 있습니다.\n\n레몬베이스 팀은 이 문제를 지속적인 성과관리(Continuous Performance Management)로 해결할 수 있다고 믿습니다. 레몬베이스를 통해 일 년에 한두 번이 아니라 일 년 내내 목표를 스스로 설정하고, 그 과정을 실시간으로 공유하고, 또 1:1 미팅을 통해 코칭을 주고받으며, 더 자주 동료들로부터 칭찬과 피드백을 받을 수 있습니다.\n\n2023년, 70억원 규모의 시리즈A 투자를 유치해 누적 투자액이 140억원으로 늘어난 레몬베이스는 현재 카카오엔터테인먼트, 컴투스, 롯데제과, 버킷플레이스, 쏘카, 카카오스타일 등 시대를 선도하는 수많은 기업과 함께 성과관리를 혁신하고 있습니다.\n\n\"회사와 구성원의 건강한 성장\"이라는 미션을 가진 레몬베이스와 함께 성장할 미래의 크루를 찾고 있습니다. 레몬베이스 팀의 여정에 동참해 주실 분들을 기다립니다.",
  "주요업무": "span레몬베이스는 팀과 함께 성장할 QA Engineer를 찾고 있습니다. 매우 도전적인 수준의 복잡도를 가진 제품을 다루는 데에 흥미를 느끼며, 팀의 첫 QA Engineer로서 주도적으로 업무의 방향을 제시하고 수행하실 수 있는 분이라면 부담 없이 지원해주시기 바랍니다.\n\n[레몬베이스 QA 엔지니어에게 이런 역할을 기대합니다]\n• 레몬베이스 제품의 전반적인 품질을 관리하고 이를 위한 테스트 및 테스트 자동화를 수행합니다.\n• 복잡한 제품 정책을 구조화하고, 효과적인 품질 관리를 위한 테스트 전략을 수립하여 수행합니다.\n• 레몬베이스 제품팀이 산출한 기획적인 내용, 디자인 산출물, 개발된 내용들에 대한 피드백을 전달하여 제품의 품질 향상에 기여합니다.\n• 상시로 레몬베이스의 제품의 기능적 결함, 버그, 디자인 이슈를 발견하고 이를 추적하여 재현 시나리오를 공유합니다.\n• 여러 채널에서 제보되는 제품 관련 문제를 수집하고 이를 효율적으로 관리합니다.\n\n[레몬베이스 QA 엔지니어로서 이런 경험을 할 수 있습니다]\n• 제품 품질의 정량화, 측정, 모니터링과 같은 QA 파이프라인을 구축하여 서비스가 품질 측면에서 안정적으로 유지될 수 있게 기여합니다.\n• 복잡한 시나리오에 대한 테스트 자동화를 도입하여 제품의 품질 향상에 기여할 수 있습니다.\n• 다양한 선진적인 테스트 방법론을 연구하고 이를 제품 QA에 도입하여 성과를 분석, 공유할 수 있습니다.",
  "자격요건": "span• 요구사항 분석을 통해 기획 단계에서 오류 도출이 가능하신 분\n• 다양한 테스트 시나리오(TS)와 테스트 케이스(TC)를 구조화하고, 이를 QA에 활용해 보신 분\n• 논리적이고 유연한 사고로 다양한 직무의 동료와 원활하고 적극적인 커뮤니케이션 가능하신 분\n• 애자일 개발 문화에 대한 경험과 이해가 있으신 분\n• 기존 업무 방식에 안주하지 않고 효율적인 프로세스를 제안하고 개선해본 경험이 있으신 분",
  "우대사항": "span• 자동화된 테스트 환경을 구축해보신 분 \n• 자기주도적으로 QA 테스트 계획 단계부터 실행, 결과 도출까지 오너십을 가지고 업무 진행을 해보신 분\n• Jira, Notion, GitHub, Slack 등 협업을 위한 도구 사용 경험이 있으신 분\n• 데이터 또는 로그를 통한 결함 및 오류 분석이 가능하신 분\n• ISTQB, CSTS 등 검증 관련 자격증을 보유하신 분\n\n\n[QA Engineer 자주 묻는 질문]\nQ. 지금까지 QA Engineer가 없었는데, 채용하게 된 계기가 궁금해요. 합류하면 어떤 역할부터 맡게 되나요?\n• 채용하게 된 계기\n    - 지금까지 레몬베이스의 QA는 Product Owner(PO)가 테스트 케이스를 정의하고, 다양한 직군이 테스트를 진행하는 방식으로 이루어졌습니다. 하지만 제품 정책이 복잡해져서 테스트 비용이 커졌고, 여러 구성원의 노력만으로 충분한 품질 보증 활동을 하기 어려워지기 시작했습니다.\n    - 따라서 이제는 제품 품질을 전문적으로 챙겨야 한다고 판단하여 QA Engineer를 채용하게 되었습니다. 제품 품질을 더욱 개선하고, 사용자들이 더 나은 경험을 누릴 수 있도록 하려면 QA 프로세스를 제대로 정립하고, 이 중에서 매뉴얼 QA와 테스트 자동화를 적절히 혼합하면서 QA 프로세스를 지속적으로 고도화해야 합니다.\n• 합류 시 역할\n  - QA Engineer가 합류하면 QA 프로세스를 수립하고, 그 프로세스를 실행하면서 개선합니다. 이를 위해, 먼저 레몬베이스 제품과 비즈니스 맥락을 학습해 제품의 목적, 기능, 요구 사항, 기술적 측면 등을 이해합니다. 그리고 이를 바탕으로 QA 프로세스를 정립합니다.\n\nQ. 제품 개발에 사용하는 개발 환경이 궁금해요.\n• 백엔드는 Python + Django, 프론트엔드는 React 기반으로 개발하고 있습니다.\n\nQ. 현재 자동화 테스트를 진행하고 있나요? 자동화된 테스트 환경을 도입하여 테스트를 운영하게 될 경우, 사용하게 될 자동화 테스트 환경이 궁금해요.\n• 특정 스쿼드에서 효율적인 QA를 위해 일부 기능에 대해 Playwright 기반의 테스트 자동화를 구축했습니다. 다만, 위 환경을 사용하셔야 하는 것은 아니고 QA Engineer 분이 적절한 도구와 환경을 제안해주시면 됩니다.\n\nQ. 어느 정도의 테스트 자동화 경험이 있어야 할지 궁금해요.\n• 웹이나 모바일 앱 기반의 서비스, API에 기반한 테스트 자동화 경험을 가지고 있는 분을 기대합니다. 효율적인 QA 업무를 위한 프로세스 자동화에 대한 경험을 가지고 계신다면 더 좋습니다.\n\nQ. 레몬베이스에서 QA 엔지니어에게 기대하는 바가 무엇인가요?\n• 단기적으로는 QA 활동을 효율적으로 re-structuring하는 것을 기대합니다.\n• 장기적으로는 레몬베이스만의 QA 방식 및 테스트 자동화 방법론을 정립하는 것을 기대합니다.\n• 또한, 테스트 자동화를 통해 QA 과정을 효율화해주시기를 기대합니다\n\nQ. 합류하게 된다면 QA Engineer는 어느 팀 혹은 스쿼드에 속하게 되나요?\n• 아직 정해진 것은 없습니다. 하지만 특정 스쿼드에 속하지는 않을 예정입니다.\n\nQ. QA팀을 셋업한 경험이 있어야 하는 포지션일까요? 현재 팀을 셋업할 계획이 있나요?\n• 지원자가 팀을 셋업한 경험이 꼭 있어야 하진 않습니다. 팀을 셋업할 가능성은 크지만, 팀 셋업 경험이 팀의 성공적인 셋업을 보장하지 않는다고 생각합니다.\n\nQ. 어떤 역량을 가진 지원자를 선호하는지 궁금해요.\n• 구조화 역량: QA 해야 할 제품의 범위가 굉장히 넓습니다. 그렇기 때문에 각각의 테스트 케이스가 생기는 상황과 원리를 파악해서, 전체 테스트를 구조화하지 않으면 일이 너무 괴로워지기 쉽습니다. 또한 테스트 자동화를 해야 할 것과 아닌 것들 사이의 구분을 잘해야 하는데, 이를 위해서 테스트 케이스를 적절히 분류하고 관리하는 노력이 필요합니다.\n• 커뮤니케이션 역량: 제품의 품질 보증 활동은 많은 이해관계자를 가지고 있습니다. PO, PD, 엔지니어, 비즈니스 그룹에 속한 동료들과 다양한 제품과 관련된 커뮤니케이션을 해야 합니다. 이런 커뮤니케이션이 어렵고 부담스럽지 않을 정도의 커뮤니케이션 역량이 필요합니다.\n• 학습 역량: 레몬베이스 팀은 단순히 QA를 신속 정확하게, 그러면서 효율적으로 해결하는 것만을 목표로 하지 않습니다. 더 높은 품질 보증 활동을 설계하고 수행하고, 제품 전체의 품질을 높이기 위해서 다양한 시도를 하고 싶습니다. 이를 위해서 새로운 영역을 함께 개척하면서 빠르게 학습할 수 있는 분을 선호합니다.\n\nQ. 현재 레몬베이스에서 제품을 기획하고 배포하는 과정이 궁금해요. 일하는 방식을 설명해주실 수 있나요?\n• 각 스쿼드마다 일하는 방식이 다른데요. 애자일 스프린트 방식으로 제품을 개발하는 조직과 Shape Up 방식을 사용하는 조직이 있습니다.\n• 리뷰 스쿼드가 활용하고 있는 애자일 스프린트 방식을 설명해 드리면 아래와 같습니다.\n    - PO가 비즈니스 맥락에 따라 우선순위를 따져서 어떤 일감들을 진행할 것인지 후보를 정합니다.\n    - 스쿼드 구성원들과 비즈니스 그룹에 속한 크루들이 함께 모여서 어떤 일감을 진행하면 좋을지 우선순위를 다시 정하고, 스프린트에 개발할 일감을 확정합니다.\n    - PO가 해당 일감의 요구사항을 분석하고 정리한 Product Pager 문서를 정리하고, 그 문서를 엔지니어들이 리뷰하면서 플래닝 포커를 거쳐서 일감의 불확실성이 무엇인지를 정리합니다.\n    - 불확실성을 어느 정도 해소한 후, 개발을 진행하면서 지속적으로 일감의 범위를 조정하면서 스프린트를 진행합니다.\n    - 제품이 배포할 수 있는 수준으로 개발되면 QA를 거쳐서 제품을 배포합니다.\n    - 제품의 배포 전후에 스프린트 리뷰를 진행합니다. 이번 배포에서 인수 조건을 맞췄는지를 확인하고, 고객 접점에 있는 크루들의 피드백을 받아서 개선해야 할 부분을 확인합니다.\n    - 마지막으로 스프린트 회고를 진행하고 스프린트를 마무리합니다.\n    - 애자일 스프린트 방식을 선택하는 스쿼드는 3주짜리 스프린트가 끝나면, 약 1주 정도 정비 기간을 가지고 다시 스프린트를 시작합니다.\n\nQ. 레몬베이스 팀에서 일을 잘한다는 것은 어떤 건가요?\n• 레몬베이스 팀에서 일하는 구성원이 어떻게 성장하고 성과 내기를 바라는지의 관점으로 답변할 수 있을 것 같습니다.\n• 첫 번째, 핵심가치. 레몬베이스 팀이 ‘이렇게 하면 성공할 수 있다’고 믿는 핵심가치와 실천원칙을 이해하고, 그것을 기반으로 일하는 방법을 실천하며 성장하고 있습니다.\n• 두 번째, Lead Work / Lead Others / Lead Self의 중요성에 공감하고 잘 실천할 수 있는 분입니다.\n    - Lead Work: 자신의 분야에 대한 전문성, 탐구심, 열정이 있습니다.\n    - Lead Others: 나의 성장과 성과만큼, 동료의 성장과 성과를 중요하게 생각하고 적극적으로 돕습니다. 이 과정에서 Kind & Direct하게 소통할 수 있는 분이면 더욱 좋아요.\n    - Lead Self: Growth Mindset을 갖고 성장을 위해 지속적으로 노력하는 분을 선호해요. 자신만의 지향점과 방식을 갖고 지속적으로 스스로 동기부여하는 분이었으면 좋겠습니다.",
  "혜택 및 복지": "span• 나의 퍼포먼스, 팀의 협업에 가장 도움이 되는 방식을 스스로 정하는, 자율적인 리모트 워킹으로 일하고 있어요.\n• 출근과 퇴근, 모든 휴식 시간을 크루 개개인의 자율에 맡기고 있으며, 최소한의 규칙(08:00~11:00 사이에 출근)만 운영합니다.\n• 다양한 업무용 도구(SaaS)를 적극적으로 발굴하여 사용합니다. Slack, Notion, Jira, Figma, Tellspin 등을 사용하고 있어요.\n• MacBook Pro/Air, iMac, LG 노트북 중 원하는 장비를 선택하여 사용합니다.\n• 크루의 건강을 챙깁니다. 월 20만 원 운동비를 지급하고, 낮에도 1시간 자유롭게 운동할 수 있어요.\n• 개인의 성과와 성장에 도움이 된다면 어떤 교육이든 한도 없이 지원합니다.\n• 회사와 구성원의 성장을 위해 필요한 책은 무엇이든 한도 없이 구매하고, 개인 소장도 가능해요.\n• 장기적인 목돈 마련을 지원하고자 내일채움공제를 운영합니다. \n• 더 나은 업무 환경을 끝없이 고민하는 피플 매니저가 있습니다. 무엇이든 제안하고, 논의합니다.\n\n[지원 및 전형 안내]\n• 지원서류: 이력서(필수), 포트폴리오(선택)\n• 채용전형: 서류 전형 ＞ 사전테스트 ＞ 직무 인터뷰 ＞ 컬처 인터뷰 ＞ 최종합격\n  - 이력 및 경험에 따라 일부 전형 과정이 생략 또는 추가될 수 있습니다.",
  "기술스택 ・ 툴": "divBitBucket\nSlack\nReact\nNext.js"
}