{
  "<h1> 제목:": "Frontend Developer(React.js, 2년 이상, 보충역 지원 가능)",
  "<a> 회사 이름:": "이제이엔",
  "<dt>기술스택": "React\nJavaScript\nTypeScript\nCSS 3\nNext.js\nRecoil",
  "<dt>주요업무": "[주요업무]\n• EJN의 주요 서비스들에 대한 웹 어플리케이션의 웹 아키텍처 설계 및 개발\n• Creator와 Fan의 창작과 후원, 커뮤니티 활동 경험을 향상시킬 수 있는 웹기반 신규 기능 실험과 개발\n• PC 및 모바일 서비스 특성에 맞춰 웹 어플리케이션 성능 향상 및 최적화를 위한 기술 탐색과 적용\n• 유저 행동 분석을 위한 데이터트래킹 방식 설계 및 이벤트 코드 삽입과 관리\n\n[개발스택]\n• Langauge : Javascript(Typescript)\n• Framework : React, Vue, Next\n• Tool : ESLint, TailwindCSS\n• CI/CD : Jenkins, Github Action",
  "<dt>자격요건": "• Typescript(Javascript) 기반 웹 프론트엔드 개발 실무 경험 2년 이상 또는 또는 이에 준하는 실력을 갖춘 분\n• Design System을 활용해 재사용 가능한 콤포넌트들을 정의하고 제작하여 디자이너와의 협업 및 개발 경험이 있는 분\n• REST API의 보안 및 인증에 대한 이해와 효율적인 API 사용 및 설계가 가능한 분\n• React, Vue등 SPA기반 프레임워크을 이용한 서비스 개발에 익숙하신 분\n• Canvas, CSS, JS 를 이용한 웹 애니메이션 제작이 가능한 분\n• 웹표준화, 웹접근성 기반 크로스브라우징을 고려한 UI개발 경험과 웹페이지 경량화와 최적화에 대한 이해가 있는 분",
  "<dt>우대사항": "• 스트리머 생태계에 대한 이해와 컨텐츠 창작 및 후원 경험이 있는 분\n• CI/CD에 대한 이해와 빌드 및 배포 파이프라인에 대한 효율화 경험이 있는 분\n• MSA에 대한 이해와 Cloud기반 유연한 확장 환경에서의 서비스 개발 경험이 있는 분\n• 시각화 라이브러리를 사용하여 다양한 형태의 대쉬보드 개발 경험이 있는 분\n• TDD에 대한 이해와 적용 경험이 있는 분\n• Agile방법론에 대한 이해 및 실무에서의 실행 경험이 있는 분",
  "<dt>복지 및 혜택": "[업무환경]\n• 아이맥, 맥북, 듀얼 모니터 등 최신 장비를 지원합니다.\n• 다양한 업무 툴(Slack, Jira, Confluence, Figma, Google Analytics, Amplitude 등)을 사용합니다.\n• 개발에 필요한 장비, SW, 업무 도서 등은 언제든지 요청할 수 있습니다.\n\n[제도 및 복지]\n• 주5일근무, 4대보험, 연차/반차 제도 운영\n• 근무시간\n- 출근 08~11시 / 퇴근: 17~20시 (본인 출근 시간에 따라 변동되는 유연근무제 운영)\n- 집중 근무 시간: 오전 11시 ~ 오후 5시\n- 집중 근무 시간 외에는 각자의 패턴에 맞춰 출퇴근 시간을 자율적으로 결정합니다.\n• 수습기간 내 급여 100% 지급합니다.\n• 코로나 거리두기 단계 별 정부 지침에 따라 재택근무를 실시하고 있습니다. (수습기간 제외)\n• 식대 1만 5천원을 지원합니다(급여 외 별도 지원).\n• 커피 머신 및 캡슐, 간식 등은 상시 제공합니다.\n• 생일상품권(5만원), 명절상품권(설20만원, 추석20만원)을 지급합니다.\n• 직원의 건강을 위한 건강검진(30만원상당)을 2년마다 1회 지원합니다.\n• 쾌적한 공간에서 근무합니다. (허먼밀러 의자, 퍼시스 가구 제공)\n• 세미나, 스터디 참석을 권장하며 비용은 회사에서 지원합니다.\n• 게임동호회, 발표 동호회 등 사내에 각종 동호회를 운영할 기회는 누구에게나 열려 있습니다.\n• Kudos(glory or praise) 사내문화를 운영하고 있습니다.\n• 단체보험(배우자, 자녀 포함)을 운영합니다.",
  "<dt>채용절차 및 기타 지원 유의사항": "※산업기능요원 보충역 편입/전직, 현역 전직으로 구분하여 지원이 가능합니다. 이력서 내에 반드시 구분과 복무기간을 기재해 주세요.\n\n[제출서류]\n• 자유 양식의 입사 지원서\n• 포트폴리오\n• Github, Gitlab 등의 코드 저장소 주소\n\n[전형절차]\n• 서류전형＞코딩테스트(Codility)＞1차 실무 면접＞2차 리더 면접＞최종 임원 면접\n• 전형절차는 일정 및 상황에 따라 변동될 수 있습니다.\n• 코딩 테스트(Codility)는 문제 해결 능력과 보유하신 스킬을 실무에서 활용 가능하신지를 검증하기 위해 진행하고 있습니다. CS(알고리즘 등) 관련 지식 위주의 테스트가 아니므로 부담 없이 지원해주세요.\n• 수습기간 3개월",
  "<dl>경력": "2 - 8년",
  "<dl>학력": "무관",
  "<dl>마감일": "상시",
  "<dl>근무지역": "서울 강남구 테헤란로 504 해성빌딩 8층\n지도보기·주소복사"
}